backButton = '◀️ НАЗАД'
continueButton = 'ПРОДОВЖИТИ'
loginButton = '🔑 УВІЙТИ'
registerButton = '📝 РЕЄСТРАЦІЯ'
restoreAccountButton = '🔄 ВІДНОВИТИ ОБЛІКОВИЙ ЗАПИС'
supportButton = '📞 ПІДТРИМКА'
reportButton = '⚠️ СКАРГА'
accountButton = '👤 МІЙ ОБЛІКОВИЙ ЗАПИС'
updatePasswordButton = '🔄 ОНОВИТИ ПАРОЛЬ'
updateLanguageButton = '🌍 ЗМІНИТИ МОВУ'
subscriptionsButton = '📂 МОЇ ПІДПИСКИ'
logoutButton = '🚪 ВИЙТИ'
joinButton = '📥 ПРИЄДНАТИСЯ'
subscriptionPlansButton = '💳 ПЛАНИ ПІДПИСКИ'
paymentButton = '💰 ОПЛАТА'
buyButton = '🛒 КУПИТИ'
monthPaymentPlanButton = '📅 1 МІСЯЦЬ'
threeMonthPaymentPlanButton = '📅 3 МІСЯЦІВ'
sixMonthPaymentPlanButton = '📅 6 МІСЯЦІВ'
yearPaymentPlanButton = '📅 1 РІК'
foreverPaymentPlanButton = '🔒 НАЗАВЖДИ'
paypalButton = '💳 PAYPAL'
bankCardButton = '🏦 БАНКІВСЬКА КАРТКА'
addMediaButton = '➕ ДОДАТИ МЕДІА'
categoryListButton = '📂 КАТЕГОРІЇ'
channelsButton = '📢 КАНАЛИ'
groupsButton = '👥 ГРУПИ'
userMediaButton = '🎥 МОЇ МЕДІА'
searchMediaButton = '🔍 ШУКАТИ'
previousButton = '◀️ ПОПЕРЕДНІЙ'
nextButton = 'НАСТУПНИЙ ▶️'
editButton = '📝 РЕДАГУВАТИ'
deleteButton = '❌ ВИДАЛИТИ'
updateNameButton = '✏️ ОНОВИТИ ІМ’Я'
updateDescriptionButton = '📝 ОНОВИТИ ОПИС'
updatePhotoButton = '📷 ОНОВИТИ ФОТО'
updateCategoryButton = '📂 ОБНОВИТИ КАТЕГОРІЮ'
updatePriceButton = '💰 ОНОВИТИ ЦІНУ'
foreverButton = 'НАЗАВЖДИ'
checkPaymentButton = 'ПІДТВЕРДИТИ ОПЛАТУ'
boostButton = 'ПОКРАЩИТИ АККАУНТ'

paymentAcceptedText = 'Оплату підтверджено'
mainMenuText = (
    '<b>DEEPWAY</b> – ваш доступ до світу ексклюзивного контенту!\n\n'
    '🎟️ Отримуйте доступ до приватних каналів і унікальних матеріалів.\n'
    '⚡ Керуйте своїми підписками безпосередньо в боті – навіть якщо ви втратите акаунт, доступ залишиться!\n'
    '🚀 Скоро з’явиться ще більше функцій і можливостей!'
)
loginMenuText = (
    '👋 Ласкаво просимо до <b>DEEPWAY</b>!\n\n'
    'Оберіть, що ви хочете зробити:\n'
    '🔄 <b>Відновити акаунт</b> – якщо ви втратили акаунт або його було видалено, відновіть доступ за допомогою резервного коду.\n'
    '🔑 <b>Увійти</b> – почніть користуватися ботом, увійшовши у свій акаунт.'
)
loginText = (
    '<b>🔑 Вхід</b>\n'
    'У вас уже є акаунт? Придумайте пароль, щоб увійти та отримати доступ до своїх підписок.\n\n'
    '💡 Якщо ви забули пароль, використайте резервний код для відновлення доступу або зверніться до підтримки.'
)
registerText = (
    '<b>📝 Реєстрація</b>\n'
    'Вперше тут? Надішліть пароль, щоб створити акаунт, отримати доступ до ексклюзивного контенту та керувати своїми підписками.\n\n'
    '💡 Якщо вам потрібна допомога, зверніться до підтримки!'
)
restoreAccountText = (
    '<b>🛡️ Відновлення акаунта</b>\n'
    'Втратили акаунт або його було видалено? Не хвилюйтеся! Надішліть ваш резервний код, щоб відновити доступ!\n\n'
    '💡 Зберігайте свій <b>резервний код</b> у безпечному місці – це ваш ключ до відновлення доступу в будь-який час.'
)
restoreAccountErrorText = (
    '<b>❌ Помилка відновлення</b>\n'
    'Введений резервний код недійсний. Перевірте код і спробуйте знову.\n\n'
    '💡 Якщо вам потрібна допомога, зверніться до підтримки.'
)
boostText = (
    '<b>🚀 Покращ свою видимість</b>\n'
    'Хочеш, щоб твої канали та групи частіше зʼявлялися в рекомендаціях?\n\n'
    '📈 Завдяки <b>щомісячній підписці</b> твої канали та групи отримають <b>на 20% більше показів</b> іншим користувачам.\n\n'
    '💡 Ідеально для швидкого зростання спільноти та розширення охоплення.\n\n'
    '🔓 СКОРО В НАЯВНОСТІ!'
)
supportText = (
    '<b>📞 Підтримка</b>\n'
    'Потрібна допомога? Наша служба підтримки завжди на зв’язку!\n\n'
    '💬 Просто опишіть вашу проблему, і ми відповімо вам якнайшвидше.'
)
supportAnswerText = (
    '<b>✅ Ваш запит прийнято!</b>\n'
    'Наша команда підтримки незабаром звʼяжеться з вами, щоб допомогти вирішити проблему.\n\n'
    '⏳ Будь ласка, зачекайте, ми відповімо найближчим часом. Дякуємо за терпіння!\n\n'
    '🆔 Номер вашого запиту: <code>{support_id}</code>, збережіть це повідомлення у вибраному!'
)
reportText = (
    '<b>🚨 Повідомити про проблему</b>\n'
    'Якщо ви помітили порушення правил або підозрілу активність, будь ласка, повідомте нам.\n\n'
    '📋 Опишіть ситуацію якомога детальніше — це допоможе нам швидше розібратися.\n\n'
    '👮‍♂️ Модератори перевірять {media_type} <b>{channel_name}</b> і вживуть необхідних заходів.'
)
reportAnswerText = (
    '<b>✅ Вашу скаргу прийнято!</b>\n'
    'Дякуємо, що допомагаєте нам підтримувати порядок і безпеку.\n\n'
    '🔍 Ми розглянемо вашу скаргу найближчим часом.'
)
usernameVerifiedText = (
    '<b>✅ Ім`я користувача підтверджено!</b>\n'
    'Введіть пароль, щоб продовжити...'
)
usernameErrorText = (
    '<b>❌ Ім`я користувача не знайдено</b>\n'
    'Це ім’я користувача не існує або було змінене. Введіть ваше старе ім’я, якщо ви його змінювали, і спробуйте знову.\n\n'
    '💡 Якщо вам потрібна допомога, зверніться до підтримки!'
)
passwordErrorText = (
    '<b>❌ Неправильний пароль</b>\n'
    'Введений пароль невірний. Спробуйте знову.\n\n'
    '💡 Якщо ви забули пароль, ви можете відновити його за допомогою резервного коду.'
)
updatePasswordText = (
    '🔑 <b>Введіть старий пароль або резервний код</b>\n'
    'Щоб оновити пароль, спочатку введіть свій поточний пароль або резервний код.'
)
updatePasswordErrorText = (
    '❌ <b>Неправильний старий пароль</b>\n'
    'Введений пароль або резервний код не збігається з нашими записами. Будь ласка, спробуйте ще раз.'
)
newPasswordText = (
    '🔐 <b>Введіть новий пароль</b>\n'
    'Будь ласка, введіть новий пароль для вашого акаунта.'
)
accountText = (
    '👤 <b>Імʼя користувача:</b> {username}\n'
    '🛡️ <b>Верифікація:</b> {verification_status}\n'
    '📂 <b>Підписки:</b> {subscription_count}\n'
    '💎 <b>Поліпшення:</b> {boost_status}\n'
)
isNotBoostedText = 'не активний ❌'
isBoostedText = 'активний до {boost_date} ✅'
isNotVerifiedText = 'не підтверджено ❌'
isVerifiedText = 'підтверджено ✅'
noAccountText = (
    '❌ Акаунт не знайдено.'
)
subscriptionsMenuText = (
    'Оберіть тип підписки:\n\n'
    '👥 <b>Підписка на групи</b> – Отримуйте ексклюзивний контент саме з груп.\n'
    '📢 <b>Підписка на канали</b> – слідкуйте за оновленнями та новинами з каналів.\n'
    'Використовуйте кнопки нижче для вибору ⬇️'
)
subscriptionTitleText = (
    '<b>📂 МОЇ ПІДПИСКИ</b>\n'
)
subscriptionText = (
    '📌 <b>{group_title}</b>\n'
    '📅 <i>З <b>{formatted_sub_date}</b> до <b>{formatted_exp_date}</b></i>\n\n'
)
noSubscriptionText = (
    '❌ У вас немає активних підписок.'
)
PaymentPlansText = (
    '💳 <b>Оберіть план підписки</b>\n'
    'Оберіть відповідний план і оформіть підписку. 🚀'
)
paymentPlanText = (
    '💳 <b>Процес оплати</b>\n'
    'Перейдіть за посиланням, щоб завершити оплату та активувати підписку.\n\n'
    '<b>{plan} тариф</b>\n'
    '💰 Ціна: <b>${price}</b>\n\n'
    'Одразу після підтвердження оплати ви отримаєте доступ до контенту.'
)
successfulPaymentText = (
    '✅ <b>Оплата успішна!</b>\n'
    'Дякуємо! Ваш платіж було успішно оброблено. 🎉\n\n'
    '🔓 Тепер у вас є доступ до підписки.\n'
    '📂 Перевірте свої підписки в меню підписок.\n'
    'Якщо у вас є питання, зверніться до нашої підтримки. Гарного користування! 😊'
)
unSuccessfulPaymentText = (
    '❌ <b>Помилка оплати</b>\n'
    'Схоже, сталася помилка під час обробки платежу.\n\n'
    '🔍 Перевірте свої платіжні дані та спробуйте ще раз.\n'
    '💡 Якщо вам потрібна допомога, зверніться до нашої підтримки.'
)
mediaMenuText = (
    'Оберіть, де шукати ексклюзивний контент:\n\n'
    '👥 <b>Групи</b> – пошук і перегляд контенту в групах.\n'
    '📢 <b>Канали</b> – гортайте та вибирайте серед каналів.\n'
    'Використовуйте кнопки нижче для вибору ⬇️'
)
userMediaMenuText = (
    'Тут ви можете керувати своїми каналами і групах:\n\n'
    '➕ <b>Створити</b> – додати новий канал і группу.\n'
    '✏️ <b>Редагувати</b> – змінити назву, опис і налаштування.\n'
    '❌ <b>Видалити </b> – повністю видалити канал і группу.\n'
    'Використовуйте кнопки нижче для вибору ⬇️'
)
mediaChooseText = (
    '<b>{Name}</b>\n'
    '{Description}\n\n'
    '{Category}'
)
noMediaChooseText = (
    '❌ <b>Немає доступного контенту</b>\n'
    'Наразі немає контенту для перегляду.'
)
mediaSelectionText = (
    'Виберіть {media_type}, якого хочете додати:\n\n'
    'Нижче наведено список чатів, де бот є адміністратором.\n'
    'Будь ласка, натисніть на потрібну кнопку ⬇️'
)
mediaNoChatsText = (
    'У вас немає {media_type}, де бот є адміністратором.\n\n'
    'Щоб додати {media_type}, виконайте наступні дії:\n'
    '1. Додайте бота до потрібного {media_type}.\n'
    '2. Призначте бота адміністратором.\n'
    '3. Дозвольте боту додавати нових учасників.\n'
    'Після цього поверніться сюди, і потрібний чат зʼявиться у списку.'
)
addDescriptionText = (
    '📝 <b>Введіть опис до цього {media_type}</b>\n\n'
    'Будь ласка, вкажіть короткий опис до цього {media_type}.'
)
descriptionEmptyErrorText = (
    '❌ <b>Опис до цього {media_type} не може бути порожнім</b>\n'
    'Будь ласка, введіть коректний опис до цього {media_type}.'
)
descriptionLengthErrorText = (
    '❌ <b>Занадто довгий опис</b>\n'
    'Опис має містити не більше ніж 250 символів.'
)
addPhotoText = (
    '📷 <b>Завантажте фото до цього {media_type}</b>\n'
    'Будь ласка, надішліть зображення до цього {media_type}.'
)
invalidPhotoErrorText = (
    '❌ <b>Некоректне фото</b>\n'
    'Будь ласка, надішліть дійсне зображення до цього {media_type}.'
)
addPlanText = (
    '💰 <b>Виберіть тарифний план для цього {media_type}</b>\n'
    'Оберіть тариф, який ви хочете встановити для цього {media_type}.\n'
    'Якщо не хочете встановлювати тариф, просто натисніть "ПРОДОВЖИТИ".'
)
addPriceText = (
    '💰 <b>Встановіть ціну для тарифу до цього {media_type}</b>\n'
    'Введіть вартість для тарифу {plan_text}.'
)
priceEmptyErrorText = (
    '❌ <b>Ціна до цього {media_type} не може бути порожньою</b>\n'
    'Будь ласка, вкажіть коректну вартість до цього {media_type}.'
)
invalidPriceErrorText = (
    '❌ <b>Некоректна ціна</b>\n'
    'Ціна має бути числом. Введіть коректне значення (наприклад, 9.99).'
)
addMediaErrorText = (
    '❌ <b>Помилка при додаванні до цього {media_type}</b>\n'
    'Сталася помилка під час створення для вашого {media_type}.'
)
addCategoryText = (
    '📂 <b>Виберіть категорію до цього {media_type}</b>\n'
    'Оберіть відповідну категорію для класифікації {media_type}.'
)
addSubcategoryText = (
    '📂 <b>Виберіть підкатегорію до цього {media_type}</b>\n'
    'Оберіть відповідну підкатегорію для вашого {media_type}.'
)
invalidCategoryText = (
    '❌ <b>Некоректна категорія</b>\n'
    'Будь ласка, виберіть існуючу категорію зі списку.'
)
startOfListText = 'Ви вже на початку списку'
endOfListText = 'Ви вже в кінці списку'
deleteMediaText = '{media_type} успішно видалено'
restartSessionText = (
    'Сесію завершено.\n'
    'Будь ласка, почніть заново.'
)
alreadyJoinedText = 'Ви вже підписані на цей {media_type}!'

channelType = 'канал'
groupType = 'групу'
plan_text = {
    'plan1': 'на місяць',
    'plan3': 'на 3 місяці',
    'plan6': 'на півроку',
    'plan12': 'на рік',
    'plan': 'назавжди'
}

categories = {
    '🌟 Популярне': [
        '🔥 Тренди та вірусне',
        '✨ Лайфхаки',
        '📱 Додатки та сервіси',
        '🎙️ Подкасти',
        '📝 Особистий блог',
    ],

    '🎨 Креатив та контент': [
        '🎬 Кіно та серіали',
        '🎵 Музика та звук',
        '🎮 Ігри та стрімінг',
        '📸 Фото та відео',
        '📚 Книги та комікси',
        '✍️ Творчість та письменництво',
    ],

    '📰 Новини та суспільство': [
        '🌍 Міжнародні новини',
        '🏛️ Політика та суспільство',
        '💼 Економіка та бізнес',
        '🌱 Екологія та сталий розвиток',
        '🔬 Наука та інновації',
    ],

    '📈 Кар`єра та саморозвиток': [
        '📚 Навчання та курси',
        '💻 IT та програмування',
        '📊 Маркетинг та SMM',
        '🗃️ Продуктивність та тайм-менеджмент',
        '💸 Фінансова грамотність',
        '🤝 Нетворкінг',
    ],

    '🤖 Технології та інновації': [
        '⚙️ Гаджети та пристрої',
        '🧠 Штучний інтелект',
        '🚗 Електротранспорт та майбутнє транспорту',
        '🚀 Космос та майбутнє',
        '📡 Кібербезпека',
        '🕹️ VR та AR',
    ],

    '💖 Спосіб життя та стосунки': [
        '👗 Мода та стиль',
        '💄 Краса та догляд',
        '🍏 Здоров`я та харчування',
        '🧘‍♀️ Психологія та усвідомленість',
        '❤️ Стосунки та спілкування',
        '🏳️‍🌈 ЛГБТК+ спільнота',
    ],

    '⚽ Спорт та хобі': [
        '🏋️‍♂️ Фітнес та тренування',
        '🏀 Баскетбол',
        '⚽ Футбол',
        '🎾 Інші види спорту',
        '🎨 Рукоділля та DIY',
        '🎲 Настільні ігри та розваги',
    ],

    '✈️ Подорожі та світ': [
        '🌎 Туризм та подорожі',
        '🚐 Кемпінг та життя на колесах',
        '🏝️ Віддалена робота та цифрове кочівництво',
    ],

    '🛍️ Покупки та економіка': [
        '🎟️ Знижки та акції',
        '🛒 Онлайн-шопінг',
        '📦 Огляди та рекомендації товарів',
        '🏦 Інвестиції та криптовалюти',
    ],

    '🐾 Природа та тварини': [
        '🐶 Домашні тварини',
        '🌳 Природа та активний відпочинок',
        '🌿 Екологічний спосіб життя',
    ],

    '🔞 NSFW (18+)': [
        '🍑 Еротика та контент для дорослих',
        '🔗 Знайомства та зустрічі',
        '🎭 Фетиші та тематичні спільноти',
    ],
}

mainMenuMedia = r'media\logo.png'
loginMenuMedia = r'media\logo.png'
userMenuMedia = r'media\profile.png'
loginMedia = r'media\login.png'
registerMedia = r'media\register.png'
passwordMedia = r'media\password.png'
restoreAccountMedia = r'media\restore.png'
supportMedia = r'media\support.png'
paymentMedia = r'media\payment.png'
subscriptionsMenuMedia = r'media\subscriptions.png'
successfulPaymentMedia = r'media\successful.png'
unsuccessfulPaymentMedia = r'media\unsuccessful.png'
errorMedia = r'media\error.png'
userMediaMenuMedia = r'media\media.png'
noMediaChooseMedia = r'media\nomedia.png'
mediaMenuMedia = r'media\media.png'
mediaSelectionMedia = r'media\media.png'
addDescriptionMedia = r'media\description.png'
addPhotoMedia = r'media\photo.png'
addCategoryMedia = r'media\category.png'
addSubcategoryMedia = r'media\subcategory.png'
addPriceMedia = r'media\price.png'
addPlanMedia = r'media\plans.png'
reportMedia = r'media\default.png'
boostMedia = r'media\default.png'
addBotMedia = r'media\addBotUK.PNG'
