backButton = '◀️ НАЗАД'
continueButton = 'ПРОДОЛЖИТЬ'
loginButton = '🔑 ВОЙТИ'
registerButton = '📝 РЕГИСТРАЦИЯ'
restoreAccountButton = '🔄 ВОССТАНОВИТЬ АККАУНТ'
supportButton = '📞 ПОДДЕРЖКА'
reportButton = '⚠️ ЖАЛОБА'
accountButton = '👤 МОЙ АККАУНТ'
updatePasswordButton = '🔄 ОБНОВИТЬ ПАРОЛЬ'
updateLanguageButton = '🌍 СМЕНИТЬ ЯЗЫК'
subscriptionsButton = '📂 МОИ ПОДПИСКИ'
logoutButton = '🚪 ВЫЙТИ'
joinButton = '📥 ПРИСОЕДИНИТЬСЯ'
subscriptionPlansButton = '💳 ТАРИФЫ ПОДПИСКИ'
paymentButton = '💰 ОПЛАТА'
buyButton = '🛒 КУПИТЬ'
monthPaymentPlanButton = '📅 1 МЕСЯЦ'
threeMonthPaymentPlanButton = '📅 3 МЕСЯЦА'
sixMonthPaymentPlanButton = '📅 6 МЕСЯЦЕВ'
yearPaymentPlanButton = '📅 1 ГОД'
foreverPaymentPlanButton = '🔒 НАВСЕГДА'
paypalButton = '💳 PAYPAL'
bankCardButton = '🏦 БАНКОВСКАЯ КАРТА'
addMediaButton = '➕ ДОБАВИТЬ МЕДИА'
categoryListButton = '📂 КАТЕГОРИИ'
channelsButton = '📢 КАНАЛЫ'
groupsButton = '👥 ГРУППЫ'
userMediaButton = '🎥 МОИ МЕДИА'
searchMediaButton = '🔍 ИСКАТЬ'
previousButton = '◀️ ПРЕДИДУЩЕЕ'
nextButton = 'ВПЕРЕД ▶️'
editButton = '📝 РЕДАКТИРОВАТЬ'
deleteButton = '❌ УДАЛИТЬ'
updateNameButton = '✏️ ОБНОВИТЬ ИМЯ'
updateDescriptionButton = '📝 ОБНОВИТЬ ОПИСАНИЕ'
updatePhotoButton = '📷 ОБНОВИТЬ ФОТО'
updateCategoryButton = '📂 ОБНОВИТЬ КАТЕГОРИЮ'
updatePriceButton = '💰 ОБНОВИТЬ ЦЕНУ'
foreverButton = 'НАВСЕГДА'
checkPaymentButton = 'ПРОВЕРИТЬ ОПЛАТУ'
boostButton = 'УЛУЧШИТЬ АККАУНТ'

paymentAcceptedText = 'Оплата подтверждена'
mainMenuText = (
    '<b>DEEPWAY</b> – ваш проводник в мир эксклюзивного контента!\n\n'
    '🎟️ Получайте доступ к приватным каналам и уникальным материалам.\n'
    '⚡ Управляйте своими подписками прямо в боте – даже если вы потеряете аккаунт, доступ сохранится!\n'
    '🚀 Впереди еще больше функций и возможностей!'
)
loginMenuText = (
    '👋 Добро пожаловать в <b>DEEPWAY</b>!\n\n'
    'Выберите, что хотите сделать:\n'
    '🔄 <b>Восстановить аккаунт</b> – если вы потеряли аккаунт или он был удален, восстановите доступ с помощью резервного кода.\n'
    '🔑 <b>Войти</b> – начните пользоваться ботом, войдя в свой аккаунт.'
)
loginText = (
    '<b>🔑 Вход</b>\n'
    'У вас уже есть аккаунт? Введите пароль, чтобы войти и получить доступ к подпискам.\n\n'
    '💡 Если вы забыли пароль, используйте резервный код для восстановления доступа или свяжитесь с поддержкой!'
)
registerText = (
    '<b>📝 Регистрация</b>\n'
    'Впервые здесь? Придумайте пароль, чтобы создать аккаунт, получить доступ к эксклюзивному контенту и управлять подписками.\n\n'
    '💡 Если вам нужна помощь, свяжитесь с поддержкой!'
)
restoreAccountText = (
    '<b>🛡️ Восстановление аккаунта</b>\n'
    'Потеряли аккаунт или он был удален? Не переживайте! Отправьте ваш резервный код, чтобы восстановить доступ!\n\n'
    '💡 Держите <b>резервный код</b> в безопасности – это ваш ключ к восстановлению доступа в любое время.'
)
restoreAccountErrorText = (
    '<b>❌ Ошибка восстановления</b>\n'
    'Введенный резервный код недействителен. Проверьте код и попробуйте снова.\n\n'
    '💡 Если вам нужна помощь, свяжитесь с поддержкой.'
)
boostText = (
    '<b>🚀 Улучши видимость</b>\n'
    'Хочешь, чтобы твои каналы и группы чаще появлялись в рекомендациях?\n\n'
    '📈 С <b>ежемесячной подпиской</b> твои каналы и группы будут получать <b>на 20% больше показов</b> другим пользователям.\n\n'
    '💡 Идеально для быстрого роста аудитории и увеличения охвата.\n\n'
    '🔓 СКОРО ДОСТУПНО!'
)
supportText = (
    '<b>📞 Поддержка</b>\n'
    'Нужна помощь? Наша служба поддержки всегда на связи!\n\n'
    '💬 Просто опишите вашу проблему, и мы ответим вам как можно скорее.'
)
supportAnswerText = (
    '<b>✅ Ваш запрос принят!</b>\n'
    'Наша команда поддержки скоро свяжется с вами, чтобы помочь решить вашу проблему.\n\n'
    '⏳ Пожалуйста, подождите, мы ответим вам в ближайшее время. Спасибо за терпение!\n\n'
    '🆔 Номер вашего запроса: <code>{support_id}</code>, сохраните данное сообщение в вашем избранном!'
)
reportText = (
    '<b>🚨 Сообщить о проблеме</b>\n'
    'Если вы столкнулись с нарушением правил или заметили что-то подозрительное, пожалуйста, сообщите нам.\n\n'
    '📋 Опишите ситуацию максимально подробно — это поможет нам быстрее разобраться.\n\n'
    '👮‍♂️ Модераторы проверят {media_type} <b>{channel_name}</b> и примут меры.'
)
reportAnswerText = (
    '<b>✅ Ваша жалоба принята!</b>\n'
    'Спасибо, что помогаете нам поддерживать порядок и безопасность.\n\n'
    '🔍 Мы рассмотрим вашу жалобу в ближайшее время.'
)
usernameVerifiedText = (
    '<b>✅ Имя пользователя подтверждено!</b>\n'
    'Введите пароль, чтобы продолжить...'
)
usernameErrorText = (
    '<b>❌ Имя пользователя не найдено</b>\n'
    'Такое имя пользователя не существует или было изменено. Введите старое имя, если вы его меняли, и попробуйте снова.\n\n'
    '💡 Если вам нужна помощь, свяжитесь с поддержкой!'
)
passwordErrorText = (
    '<b>❌ Неверный пароль</b>\n'
    'Введенный пароль неверен. Попробуйте снова.\n\n'
    '💡 Если вы забыли пароль, вы можете восстановить его с помощью резервного кода.'
)
updatePasswordText = (
    '🔑 <b>Введите старый пароль или резервный код</b>\n'
    'Чтобы обновить пароль, сначала введите текущий пароль или резервный код.'
)
updatePasswordErrorText = (
    '❌ <b>Неверный старый пароль</b>\n'
    'Введённый пароль или резервный код не совпадает с данными в системе. Пожалуйста, попробуйте снова.'
)
newPasswordText = (
    '🔐 <b>Введите новый пароль</b>\n'
    'Пожалуйста, введите новый пароль для вашего аккаунта.'
)
accountText = (
    '👤 <b>Имя пользователя:</b> {username}\n'
    '🛡️ <b>Верификация:</b> {verification_status}\n'
    '📂 <b>Подписки:</b> {subscription_count}\n'
    '💎 <b>Улучшение:</b> {boost_status}\n'
)
isNotBoostedText = 'не активен ❌'
isBoostedText = 'активен до {boost_date} ✅'
isNotVerifiedText = 'не верифицирован ❌'
isVerifiedText = 'верифицирован ✅'
noAccountText = (
    '❌ Аккаунт не найден.'
)
subscriptionsMenuText = (
    'Выберите тип подписки:\n\n'
    '👥 <b>Подписка на группы</b> – получайте эксклюзивный контент именно из групп.\n'
    '📢 <b>Подписка на каналы</b> – следите за обновлениями и новостями из каналов.\n'
    'Используйте кнопки ниже для выбора ⬇️'
)
subscriptionTitleText = (
    '<b>📂 МОИ ПОДПИСКИ</b>\n'
)
subscriptionText = (
    '📌 <b>{group_title}</b>\n'
    '📅 <i>С <b>{formatted_sub_date}</b> по <b>{formatted_exp_date}</b></i>\n\n'
)
noSubscriptionText = (
    '❌ У вас нет активных подписок.'
)
paymentPlansText = (
    '💳 <b>Выберите план подписки</b>\n'
    'Выберите подходящий план и оформите подписку. 🚀'
)
paymentPlanText = (
    '💳 <b>Процесс оплаты</b>\n'
    'Перейдите по ссылке для завершения оплаты и активации подписки.\n\n'
    '<b>{plan} тариф</b>\n'
    '💰 Цена: <b>${price}</b>\n\n'
    'После подтверждения оплаты вам будет предоставлен мгновенный доступ к эксклюзивному контенту.'
)
successfulPaymentText = (
    '✅ <b>Оплата успешна!</b>\n'
    'Спасибо! Ваш платеж успешно обработан. 🎉\n\n'
    '🔓 Теперь у вас есть доступ к подписке.\n'
    '📂 Проверьте свои подписки в меню подписок.\n'
    'Если у вас есть вопросы, свяжитесь с нашей поддержкой. Приятного пользования! 😊'
)
unSuccessfulPaymentText = (
    '❌ <b>Ошибка оплаты</b>\n'
    'Похоже, произошла ошибка во время обработки платежа.\n\n'
    '🔍 Проверьте данные платежа и попробуйте снова.\n'
    '💡 Если вам нужна помощь, свяжитесь с нашей поддержкой.'
)
mediaMenuText = (
    'Выберите, где искать эксклюзивный контент:\n\n'
    '👥 <b>Группы</b> – поиск и просмотр контента в группах.\n'
    '📢 <b>Каналы</b> – листайте и выбирайте из каналов.\n' 
    'Используйте кнопки ниже для выбора ⬇️ '
)
userMediaMenuText = (
    'Здесь вы можете управлять своими каналами или группами:\n\n'
    '➕ <b>Создать</b> – добавьте новый канал или группу.\n'
    '✏️ <b>Редактировать</b> – измените название, описание и настройки.\n'
    '❌ <b>Удалить</b> – полностью удалите канал или группу.\n'
    'Используйте кнопки ниже для выбора ⬇️'
)
mediaChooseText = (
    '<b>{Name}</b>\n'
    '{Description}\n\n'
    '{Category}'
)
noMediaChooseText = (
    '❌ <b>Нет доступного контента</b>\n'
    'На данный момент нет контента для отображения.'
)
mediaSelectionText = (
    'Выберите {media_type}, которую хотите добавить:\n\n'
    'Ниже представлен список чатов, где бот является администратором.\n'
    'Пожалуйста, нажмите на нужную кнопку ⬇️'
)
mediaNoChatsText = (
    'У вас отсутствует {media_type}, в которых бот является администратором.\n\n'
    'Чтобы добавить {media_type}, выполните следующие действия:\n'
    '1. Добавьте бота в нужный {media_type}.\n'
    '2. Назначьте бота администратором.\n'
    '3. Разрешите боту добавлять новых участников.\n'
    'После этого вернитесь сюда, и нужный чат появится в списке.'
)
addDescriptionText = (
    '📝 <b>Введите описание под этот {media_type}</b>\n\n'
    'Пожалуйста, укажите краткое описание под этот {media_type}.'
)
descriptionEmptyErrorText = (
    '❌ <b>Описание под этот {media_type} не может быть пустым</b>\n'
    'Пожалуйста, введите корректное описание под этот {media_type}.'
)
descriptionLengthErrorText = (
    '❌ <b>Слишком длинное описание</b>\n'
    'Описание должно содержать не более 250 символов.'
)
addPhotoText = (
    '📷 <b>Загрузите фото под этот {media_type}</b>\n'
    'Пожалуйста, отправьте изображение под этот {media_type}.'
)
invalidPhotoErrorText = (
    '❌ <b>Некорректное фото</b>\n'
    'Пожалуйста, отправьте действительное изображение под этот {media_type}.'
)
addPlanText = (
    '💰 <b>Выберите тарифный план под этот {media_type}</b>\n'
    'Определите тариф, который вы хотите установить под этот {media_type}.\n'
    'Если вы не хотите устанавливать тариф, просто нажмите "ПРОДОЛЖИТЬ".'
)
addPriceText = (
    '💰 <b>Установите цену для тарифа под этот {media_type}</b>\n'
    'Введите стоимость для тарифа {plan_text}.'
)
priceEmptyErrorText = (
    '❌ <b>Цена под этот {media_type} не может быть пустой</b>\n'
    'Пожалуйста, укажите корректную стоимость под этот {media_type}.'
)
invalidPriceErrorText = (
    '❌ <b>Некорректная цена</b>\n'
    'Цена должна быть числом. Введите корректное значение (например, 9.99).'
)
addMediaErrorText = (
    '❌ <b>Ошибка при добавлении под этот {media_type}</b>\n'
    'Произошла ошибка при создании для вашего {media_type}.'
)
addCategoryText = (
    '📂 <b>Выберите категорию под этот {media_type}</b>\n'
    'Выберите подходящую категорию для классификации {media_type}.'
)
addSubcategoryText = (
    '📂 <b>Выберите подкатегорию под этот {media_type}</b>\n'
    'Выберите соответствующую подкатегорию для вашего {media_type}.'
)
invalidCategoryText = (
    '❌ <b>Некорректная категория</b>\n'
    'Пожалуйста, выберите существующую категорию из списка.'
)
startOfListText = 'Вы уже в начале списка'
endOfListText = 'Вы уже в конце списка'
deleteMediaText = '{media_type} успешно удалено'
restartSessionText = (
    'Сессия истекла.\n'
    'Пожалуйста, начните заново'
)
alreadyJoinedText = 'Вы уже подписаны на этот {media_type}!'

channelType = 'канал'
groupType = 'группу'
plan_text = {
    'plan1': 'на месяц',
    'plan3': 'на 3 месяца',
    'plan6': 'на пол года',
    'plan12': 'на год',
    'plan': 'навсегда'
}

categories = {
    '🌟 Популярное': [
        '🔥 Тренды и вирусы',
        '✨ Лайфхаки',
        '📱 Приложения и сервисы',
        '🎙️ Подкасты',
        '📝 Личный блог',
    ],

    '🎨 Креатив и контент': [
        '🎬 Кино и сериалы',
        '🎵 Музыка и звук',
        '🎮 Игры и стриминг',
        '📸 Фото и видео',
        '📚 Книги и комиксы',
        '✍️ Творчество и писательство',
    ],

    '📰 Новости и общество': [
        '🌍 Международные новости',
        '🏛️ Политика и общество',
        '💼 Экономика и бизнес',
        '🌱 Экология и устойчивость',
        '🔬 Наука и инновации',
    ],

    '📈 Карьера и саморазвитие': [
        '📚 Обучение и курсы',
        '💻 IT и программирование',
        '📊 Маркетинг и SMM',
        '🗃️ Продуктивность и тайм-менеджмент',
        '💸 Финансовая грамотность',
        '🤝 Нетворкинг',
    ],

    '🤖 Технологии и инновации': [
        '⚙️ Гаджеты и устройства',
        '🧠 Искусственный интеллект',
        '🚗 Электротранспорт и будущее транспорта',
        '🚀 Космос и будущее',
        '📡 Кибербезопасность',
        '🕹️ VR и AR',
    ],

    '💖 Образ жизни и отношения': [
        '👗 Мода и стиль',
        '💄 Красота и уход',
        '🍏 Здоровье и питание',
        '🧘‍♀️ Психология и осознанность',
        '❤️ Отношения и общение',
        '🏳️‍🌈 ЛГБТК+ сообщество',
    ],

    '⚽ Спорт и хобби': [
        '🏋️‍♂️ Фитнес и тренировки',
        '🏀 Баскетбол',
        '⚽ Футбол',
        '🎾 Другие виды спорта',
        '🎨 Рукоделие и DIY',
        '🎲 Настольные игры и развлечения',
    ],

    '✈️ Путешествия и мир': [
        '🌎 Туризм и путешествия',
        '🚐 Кемпинг и жизнь на колёсах',
        '🏝️ Удалённая работа и цифровое кочевничество',
    ],

    '🛍️ Покупки и экономика': [
        '🎟️ Скидки и акции',
        '🛒 Онлайн-шоппинг',
        '📦 Обзоры и рекомендации товаров',
        '🏦 Инвестиции и криптовалюты',
    ],

    '🐾 Природа и животные': [
        '🐶 Домашние питомцы',
        '🌳 Природа и активный отдых',
        '🌿 Экологический образ жизни',
    ],

    '🔞 NSFW (18+)': [
        '🍑 Эротика и контент для взрослых',
        '🔗 Знакомства и встречи',
        '🎭 Фетиши и тематические сообщества',
    ],
}

mainMenuMedia = r'media\logo.png'
loginMenuMedia = r'media\logo.png'
userMenuMedia = r'media\profile.png'
loginMedia = r'media\login.png'
registerMedia = r'media\register.png'
passwordMedia = r'media\password.png'
restoreAccountMedia = r'media\restore.png'
supportMedia = r'media\support.png'
paymentMedia = r'media\payment.png'
subscriptionsMenuMedia = r'media\subscriptions.png'
successfulPaymentMedia = r'media\successful.png'
unsuccessfulPaymentMedia = r'media\unsuccessful.png'
errorMedia = r'media\error.png'
userMediaMenuMedia = r'media\media.png'
noMediaChooseMedia = r'media\nomedia.png'
mediaMenuMedia = r'media\media.png'
mediaSelectionMedia = r'media\media.png'
addDescriptionMedia = r'media\description.png'
addPhotoMedia = r'media\photo.png'
addCategoryMedia = r'media\category.png'
addSubcategoryMedia = r'media\subcategory.png'
addPriceMedia = r'media\price.png'
addPlanMedia = r'media\plans.png'
reportMedia = r'media\default.png'
boostMedia = r'media\default.png'
addBotMedia = r'media\addBotRU.PNG'